In [1]:
# Importing Libraries
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt  

# Loading Data
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

# Data Cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

c:\Users\sande\anaconda3\envs\my_learnings\Lib\site-packages\tqdm\auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html
  from .autonotebook import tqdm as notebook_tqdm

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 785741 entries, 0 to 785740
Data columns (total 17 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   job_title_short        785741 non-null  object
 1   job_title              785740 non-null  object
 2   job_location           784696 non-null  object
 3   job_via                785733 non-null  object
 4   job_schedule_type      773074 non-null  object
 5   job_work_from_home     785741 non-null  bool
 6   search_location        785741 non-null  object
 7   job_posted_date        785741 non-null  datetime64[ns]
 8   job_no_degree_mention  785741 non-null  bool
 9   job_health_insurance   785741 non-null  bool
 10  job_country            785692 non-null  object
 11  salary_rate            33067 non-null   object
 12  salary_year_avg        22003 non-null   float64
 13  salary_hour_avg        10662 non-null   float64
 14  company_name           785723 non-null  object
 15  job_skills             668704 non-null  object
 16  job_type_skills        668704 non-null  object
dtypes: bool(3), datetime64[ns](1), float64(2), object(11)
memory usage: 86.2+ MB

In [3]:

median_salary_hour = df['salary_hour_avg'].median()
median_salary_hour

45.97999954223633

In [4]:
median_salary_year =  df['salary_year_avg'].median()
median_salary_year

115000.0

In [5]:
#we have this NaN values between these two column range 
#below is the way we are accesing the column with the help of the .loc method where :10 means we wand 10 rows 
# and inside '' we added the coulumn name that we want

df.loc[:10,'salary_year_avg':'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0               NaN              NaN
1               NaN              NaN
2               NaN              NaN
3               NaN              NaN
4               NaN              NaN
5               NaN              NaN
6               NaN              NaN
7               NaN              NaN
8               NaN              NaN
9               NaN              NaN
10              NaN              NaN

In [6]:
#since we dont want to mess up original data we will make new varible and will assign it to our original so we will have two database 
#so we need to worry if we just messed up the new one

df_filled = df.copy() #so both database has its own ID

In [7]:

#we will be assiginig median valeus to NaN by .fillna() method 
df_filled['salary_year_avg'] = df_filled['salary_year_avg'].fillna(median_salary_year)
df_filled['salary_hour_avg'] = df_filled['salary_hour_avg'].fillna(median_salary_hour)

df_filled.loc[:,['salary_year_avg', 'salary_hour_avg']]

        salary_year_avg  salary_hour_avg
0              115000.0            45.98
1              115000.0            45.98
2              115000.0            45.98
3              115000.0            45.98
4              115000.0            45.98
...                 ...              ...
785736         115000.0            45.98
785737         115000.0            45.98
785738         115000.0            45.98
785739         115000.0            45.98
785740         115000.0            45.98

[785741 rows x 2 columns]

In [8]:
#now we just add median values of the NaN but now we want to remove the duplicate from the table. so we will agian assign new variable
#exactly we did for the df_filled one not to mess up. we will call it df_unique 
df_unique = df_filled.copy()

# now removing duplicate values from entire table using .drop_duplicates method. we need to assign the data frame to it self to make change 
#in the datset


df_unique = df_unique.drop_duplicates()

print('leangth of original df:       ', len(df_filled))
print('length of dropped duplicates:  ', len(df_unique))
print('rows droped:                   ', len(df_filled) -len( df_unique))

leangth of original df:        785741
length of dropped duplicates:   785640
rows droped:                    101

In [9]:
# we can use subset parameter inside the .drop_duplicate() method to secifiy using this coulmn if there is any repetation remove that row. 
#so lets do above but this time using subset in the .drop_dulicates() method

df_unique = df_unique.drop_duplicates(subset= ['job_title','company_name'])

print('leangth of original df:       ', len(df_filled))
print('length of dropped duplicates:  ', len(df_unique))
print('rows droped:                   ', len(df_filled) -len( df_unique))

leangth of original df:        785741
length of dropped duplicates:   508042
rows droped:                    277699